In [2]:
import pandas as pd

In [3]:
obj=pd.Series([4,5,6,7])

In [4]:
obj

0    4
1    5
2    6
3    7
dtype: int64

In [5]:
obj.values

array([4, 5, 6, 7], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2=pd.Series(obj,index=['a','b','d','c'])

In [8]:
obj2

a   NaN
b   NaN
d   NaN
c   NaN
dtype: float64

In [12]:
obj2=pd.Series(obj.values,index=['a','b','d','c'])

In [10]:
obj2

a    4
b    5
d    6
c    7
dtype: int64

In [13]:
obj2[obj2>5]

d    6
c    7
dtype: int64

In [14]:
d in obj2

NameError: name 'd' is not defined

In [15]:
5 in obj2

False

In [16]:
'd' in obj2

True

In [17]:
6 in obj2

False

In [18]:
if ('d' in obj2):
    print(obj2['d'])

6

In [19]:
obj2['d']

6

In [20]:
pd.notnull(obj2)

a    True
b    True
d    True
c    True
dtype: bool

In [21]:
pd.isnull(obj2)

a    False
b    False
d    False
c    False
dtype: bool

In [22]:
obj2.isnull()

a    False
b    False
d    False
c    False
dtype: bool

In [23]:
obj2.notnull()

a    True
b    True
d    True
c    True
dtype: bool

In [24]:
data= {'state':['nawabshah','khi','khi','lhr','lhr','lhr','isl'],
        'year':[2001,2001,2002,2001,2002,2003,2001],
        'temp':[5,15,20,3,4,0,3]}

In [25]:
frame=pd.DataFrame(data)

In [26]:
frame

       state  year  temp
0  nawabshah  2001     5
1        khi  2001    15
2        khi  2002    20
3        lhr  2001     3
4        lhr  2002     4
5        lhr  2003     0
6        isl  2001     3

In [27]:
frame.head()

       state  year  temp
0  nawabshah  2001     5
1        khi  2001    15
2        khi  2002    20
3        lhr  2001     3
4        lhr  2002     4

In [28]:
pd.DataFrame(data,columns=['year','state','temp'])

   year      state  temp
0  2001  nawabshah     5
1  2001        khi    15
2  2002        khi    20
3  2001        lhr     3
4  2002        lhr     4
5  2003        lhr     0
6  2001        isl     3

In [29]:
df=pd.DataFrame(data,columns=['year','state','temp'],index=['a','b','c','e','f','d','a'])

In [30]:
df

   year      state  temp
a  2001  nawabshah     5
b  2001        khi    15
c  2002        khi    20
e  2001        lhr     3
f  2002        lhr     4
d  2003        lhr     0
a  2001        isl     3

In [31]:
df['eastern']=df.state='ohio'

In [32]:
df

   year state  temp eastern
a  2001  ohio     5    ohio
b  2001  ohio    15    ohio
c  2002  ohio    20    ohio
e  2001  ohio     3    ohio
f  2002  ohio     4    ohio
d  2003  ohio     0    ohio
a  2001  ohio     3    ohio

In [33]:
df['eastern']=range(7)

In [34]:
df

   year state  temp  eastern
a  2001  ohio     5        0
b  2001  ohio    15        1
c  2002  ohio    20        2
e  2001  ohio     3        3
f  2002  ohio     4        4
d  2003  ohio     0        5
a  2001  ohio     3        6

In [35]:
#addition of a column in a data frame having same index
df['pop']=[1000,2000,500,300,120,570,800]

In [36]:
df

   year state  temp  eastern   pop
a  2001  ohio     5        0  1000
b  2001  ohio    15        1  2000
c  2002  ohio    20        2   500
e  2001  ohio     3        3   300
f  2002  ohio     4        4   120
d  2003  ohio     0        5   570
a  2001  ohio     3        6   800

In [37]:
#deletion of a column 
del[df['eastern']]

In [38]:
df

   year state  temp   pop
a  2001  ohio     5  1000
b  2001  ohio    15  2000
c  2002  ohio    20   500
e  2001  ohio     3   300
f  2002  ohio     4   120
d  2003  ohio     0   570
a  2001  ohio     3   800

In [39]:
#transpose
df.T

          a     b     c     e     f     d     a
year   2001  2001  2002  2001  2002  2003  2001
state  ohio  ohio  ohio  ohio  ohio  ohio  ohio
temp      5    15    20     3     4     0     3
pop    1000  2000   500   300   120   570   800

In [40]:
df.index.name='Rows' ;df.columns.name='column'

In [41]:
df

column  year state  temp   pop
Rows
a       2001  ohio     5  1000
b       2001  ohio    15  2000
c       2002  ohio    20   500
e       2001  ohio     3   300
f       2002  ohio     4   120
d       2003  ohio     0   570
a       2001  ohio     3   800

In [42]:
# Reindex
import numpy as np
df1=pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','b','d'],columns=['year','stat','temp'])

In [43]:
df1

   year  stat  temp
a     0     1     2
b     3     4     5
d     6     7     8

In [44]:
df2=df1.reindex(['a','b','c','d'])

In [45]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   NaN   NaN   NaN
d   6.0   7.0   8.0

In [49]:
df3=df2.T

df3

In [51]:
df2.T

        a    b   c    d
year  0.0  3.0 NaN  6.0
stat  1.0  4.0 NaN  7.0
temp  2.0  5.0 NaN  8.0

In [52]:
df2.loc['b']

year    3.0
stat    4.0
temp    5.0
Name: b, dtype: float64

In [57]:
df2['year']

a    0.0
b    3.0
c    NaN
d    6.0
Name: year, dtype: float64

In [58]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   NaN   NaN   NaN
d   6.0   7.0   8.0

In [59]:
df2.loc['c']

year   NaN
stat   NaN
temp   NaN
Name: c, dtype: float64

In [60]:
df2.loc['c']=2

In [62]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [64]:
#loc is great
df2.loc[['c','d'],'stat']

c    2.0
d    7.0
Name: stat, dtype: float64

In [70]:
df2.iloc[[2,3],1]

c    2.0
d    7.0
Name: stat, dtype: float64

In [71]:
df2.iloc[2:4,1]

c    2.0
d    7.0
Name: stat, dtype: float64

In [72]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [74]:
df2.drop('temp',axis=1)

   year  stat
a   0.0   1.0
b   3.0   4.0
c   2.0   2.0
d   6.0   7.0

In [75]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [78]:
df2.drop('a')

   year  stat  temp
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [79]:
df2.add(df2,fill_value=0)

   year  stat  temp
a   0.0   2.0   4.0
b   6.0   8.0  10.0
c   4.0   4.0   4.0
d  12.0  14.0  16.0

In [80]:
df2.reindex(['year','stat','temp','pop'])

      year  stat  temp
year   NaN   NaN   NaN
stat   NaN   NaN   NaN
temp   NaN   NaN   NaN
pop    NaN   NaN   NaN

In [81]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [82]:
df2.reindex(columns=['year','stat','temp','pop'])

   year  stat  temp  pop
a   0.0   1.0   2.0  NaN
b   3.0   4.0   5.0  NaN
c   2.0   2.0   2.0  NaN
d   6.0   7.0   8.0  NaN

In [83]:
df2.reindex(list('abcde'))

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0
e   NaN   NaN   NaN

In [87]:
df2.reindex(index=list('abcdef'), labels=['year','stat','temp','pop'],columns=['year','stat','temp','pop'])

   year  stat  temp  pop
a   0.0   1.0   2.0  NaN
b   3.0   4.0   5.0  NaN
c   2.0   2.0   2.0  NaN
d   6.0   7.0   8.0  NaN
e   NaN   NaN   NaN  NaN
f   NaN   NaN   NaN  NaN

In [88]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   2.0   2.0   2.0
d   6.0   7.0   8.0

In [89]:
df3=df2.reindex(columns=['year','stat','temp','pop'])

In [90]:
df3

   year  stat  temp  pop
a   0.0   1.0   2.0  NaN
b   3.0   4.0   5.0  NaN
c   2.0   2.0   2.0  NaN
d   6.0   7.0   8.0  NaN

In [91]:
df3.loc['pop']=list('abcd')

In [92]:
df3

    year stat temp  pop
a      0    1    2  NaN
b      3    4    5  NaN
c      2    2    2  NaN
d      6    7    8  NaN
pop    a    b    c    d

In [93]:
df3.loc['pop']

year    a
stat    b
temp    c
pop     d
Name: pop, dtype: object

In [96]:
df3

    year stat temp
a      0    1    2
b      3    4    5
c      2    2    2
d      6    7    8
pop    a    b    c

In [99]:
#del function delete columns but drop funtion delete both
#del df3.loc['pop'] won't work
df3.drop('pop')

  year stat temp
a    0    1    2
b    3    4    5
c    2    2    2
d    6    7    8

In [100]:
df3

    year stat temp
a      0    1    2
b      3    4    5
c      2    2    2
d      6    7    8
pop    a    b    c

In [115]:
ob=pd.Series([7,-5,7,4,2,])

In [116]:
ob

0    7
1   -5
2    7
3    4
4    2
dtype: int64

In [117]:
ob.rank()

0    4.5
1    1.0
2    4.5
3    3.0
4    2.0
dtype: float64

In [121]:
obj=pd.Series([4,-3,2,3])

In [122]:
obj.rank(method='max')

0    4.0
1    1.0
2    2.0
3    3.0
dtype: float64